Revit 2024 API
FailureMessageKey.IsValid Method
 Checks if the failure message key is valid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public bool IsValid()
Visual Basic
Public Function IsValid As Boolean
Visual C++
public:
bool IsValid()
Return Value
 True if the failure message key is valid
See Also
FailureMessageKey Class
Autodesk.Revit.DB Namespace